{
  "pt": {
    "menu_inicio": "INICIO",
    "menu_educacao": "EDUCAÇÃO",
    "menu_profissional": "PROFISSIONAL",
    "menu_projetos": "PROJETOS",
    "whoami": "<h3>Olá, meu nome é <u>João Victor</u> e sou engenheiro eletricista formado pela UNESP de Ilha Solteira. </h3><br>Atualmente, trabalho no setor de óleo e gás na SBM Offshore, atuando com inteligência operacional e monitoramento preditivo de equipamentos em plataformas FPSO. Tenho grande interesse por análise de dados, Python, automação industrial e tecnologia de ponta aplicada à engenharia. Além disso, gosto de desafios, aprender coisas novas e desenvolver soluções que realmente fazem a diferença. <br>Fora do ambiente profissional, sou apaixonado por finanças, esportes e tecnologia — e quando posso, estou jogando ou estudando algo novo.",
    "timeline": "Minha história",
    "timeline_titulo1": "2014 - Certificado em Webdesigner (AEComp)",
    "timeline_texto1": "Durante minha adolescência, o interesse por jogos online foi o que despertou minha curiosidade pelo mundo da programação. Tudo começou com servidores alternativos do jogo Priston Tale, onde aprendi a modificar arquivos do jogo, explorar bancos de dados com SQL e até realizar engenharia reversa utilizando hexadecimal. Essa experiência inicial me proporcionou uma base sólida para me aprofundar no universo do desenvolvimento. Motivado por essa descoberta, participei de um curso introdutório oferecido pela antiga escola da AEComp, em Pirajuí, onde tive meu primeiro contato com tecnologias como Macromedia Flash, Dreamweaver, HTML, CSS e PHP.",
    "timeline_titulo2": "2015 - Colégio Técnico Industrial - Informática",
    "timeline_texto2": "Com o objetivo de me aprofundar ainda mais no campo da programação, ingressei em um dos cursos técnicos mais reconhecidos do Brasil: o Colégio Técnico Industrial \"Isaac Portal Roldán\" (CTI da UNESP), localizado em Bauru-SP. Durante os dois anos em que estive no CTI, tive acesso a uma formação sólida em linguagens como PHP, Java e C/C++, além de disciplinas complementares como design, estatística, matemática avançada e fundamentos de hardware voltados à computação. Apesar do curso ter duração de três anos, precisei interrompê-lo ao final do segundo ano para iniciar minha graduação universitária.",
    "timeline_titulo3": "2017 - Ingresso na UNESP de Ilha Solteira - Engenharia Elétrica",
    "timeline_texto3": "Em determinado momento, percebi que meu conhecimento em software já era suficiente para desenvolver os projetos que sempre idealizei. Faltava, no entanto, uma compreensão mais profunda sobre hardware e sobre o funcionamento dos sistemas físicos por trás da tecnologia. Com esse objetivo, decidi prestar o vestibular para Engenharia Elétrica na UNESP — onde tive a felicidade de ser aprovado. A graduação me proporcionou uma formação sólida e experiências enriquecedoras, passando por áreas como sensoriamento veicular, máquinas elétricas, algoritmos lógicos, entre outros temas técnicos e científicos. Concluí minha formação em janeiro de 2023, levando comigo não apenas conhecimento técnico, mas também crescimento pessoal e profissional."

  },
  "en": {
    "menu_inicio": "HOME",
    "menu_educacao": "EDUCATION",
    "menu_profissional": "PROFESSIONAL",
    "menu_projetos": "PROJECTS",
    "whoami": "<h3>Hello, my name is <u>João Victor</u> and I’m an electrical engineer graduated from UNESP (São Paulo State University).</h3><br> I currently work in the oil and gas industry at SBM Offshore, focusing on operational intelligence and predictive monitoring of equipment on FPSO platforms. I’m passionate about data analysis, Python, industrial automation, and cutting-edge technology applied to engineering. I enjoy solving complex problems, learning continuously, and developing solutions that deliver real impact. <br>Outside of work, I’m into finance, tech, and sports — and I’m always up for a good game or diving into something new to learn.",
    "timeline": "About me",
    "timeline_titulo1": "2013 - Webdesigner certification (AEComp)",
    "timeline_texto1": "During my teenage years, my passion for online games sparked a deep curiosity for programming. It all began with custom servers of the game Priston Tale, where I learned to modify game files, work with SQL databases, and even perform reverse engineering using hexadecimal code. This early experience laid the foundation for my journey into the development world. Driven by this interest, I enrolled in an introductory course at the former AEComp school in Pirajuí, where I was first introduced to technologies such as Macromedia Flash, Dreamweaver, HTML, CSS, and PHP.",
    "timeline_titulo2": "2015 - Technical course at Colégio Técnico Industrial - IT",
    "timeline_texto2": "Aiming to further develop my programming skills, I enrolled in one of Brazil’s most prestigious technical high schools: the Colégio Técnico Industrial “Isaac Portal Roldán” (CTI–UNESP), located in Bauru, São Paulo. During my two years at CTI, I received a strong foundation in programming languages such as PHP, Java, and C/C++, along with complementary subjects like design, statistics, advanced mathematics, and computer hardware. Although the full program spanned three years, I made the decision to leave at the end of the second year to pursue a university degree.",
    "timeline_titulo3": "2017 - Ingress on Electrical Engineering graduation.",
    "timeline_texto3": "At a certain point, I realized my knowledge of software had reached a level that allowed me to build the kinds of projects I had always envisioned. What I needed next was a deeper understanding of hardware and how systems work at a fundamental level. With that in mind, I decided to pursue a degree in Electrical Engineering at UNESP—and was fortunate to be accepted. University life brought a wide range of learning experiences, from vehicle sensing systems and electric machines to logical algorithms and various technical subjects. I graduated in January 2023, carrying with me not only strong technical foundations but also valuable personal and professional growth."
  }
}