{
  "pt": {
    "menu_inicio": "INICIO",
    "menu_educacao": "EDUCAÇÃO",
    "menu_profissional": "PROFISSIONAL",
    "menu_projetos": "PROJETOS",
    "whoami": "<h3>Olá, meu nome é <u>João Victor</u>, tenho 26 anos e sou engenheiro eletricista formado pela UNESP de Ilha Solteira. </h3><br>Atualmente, trabalho no setor de óleo e gás na SBM Offshore, atuando com inteligência operacional e monitoramento preditivo de equipamentos em plataformas FPSO. Tenho grande interesse por análise de dados, Python, automação industrial e tecnologia de ponta aplicada à engenharia. Além disso, gosto de desafios, aprender coisas novas e desenvolver soluções que realmente fazem a diferença. <br>Fora do ambiente profissional, sou apaixonado por finanças, esportes e tecnologia — e quando posso, estou jogando ou estudando algo novo.",
    "timeline": "Minha história",
    "timeline_titulo1": "2014 - Certificado em Webdesigner (AEComp)",
    "timeline_texto1": "Durante minha adolescência, o interesse por jogos online foi o que despertou minha curiosidade pelo mundo da programação. Tudo começou com servidores alternativos do jogo Priston Tale, onde aprendi a modificar arquivos do jogo, explorar bancos de dados com SQL e até realizar engenharia reversa utilizando hexadecimal. Essa experiência inicial me proporcionou uma base sólida para me aprofundar no universo do desenvolvimento. Motivado por essa descoberta, participei de um curso introdutório oferecido pela antiga escola da AEComp, em Pirajuí, onde tive meu primeiro contato com tecnologias como Macromedia Flash, Dreamweaver, HTML, CSS e PHP.",
    "timeline_titulo2": "2015 - Colégio Técnico Industrial - Informática",
    "timeline_texto2": "Com o objetivo de me aprofundar ainda mais no campo da programação, ingressei em um dos cursos técnicos mais reconhecidos do Brasil: o Colégio Técnico Industrial \"Isaac Portal Roldán\" (CTI da UNESP), localizado em Bauru-SP. Durante os dois anos em que estive no CTI, tive acesso a uma formação sólida em linguagens como PHP, Java e C/C++, além de disciplinas complementares como design, estatística, matemática avançada e fundamentos de hardware voltados à computação. Apesar do curso ter duração de três anos, precisei interrompê-lo ao final do segundo ano para iniciar minha graduação universitária.",
    "timeline_titulo3": "2017 - Ingresso na UNESP de Ilha Solteira - Engenharia Elétrica",
    "timeline_texto3": "Em determinado momento, percebi que meu conhecimento em software já era suficiente para desenvolver os projetos que sempre idealizei. Faltava, no entanto, uma compreensão mais profunda sobre hardware e sobre o funcionamento dos sistemas físicos por trás da tecnologia. Com esse objetivo, decidi prestar o vestibular para Engenharia Elétrica na UNESP — onde tive a felicidade de ser aprovado. A graduação me proporcionou uma formação sólida e experiências enriquecedoras, passando por áreas como sensoriamento veicular, máquinas elétricas, algoritmos lógicos, entre outros temas técnicos e científicos. Concluí minha formação em janeiro de 2023, levando comigo não apenas conhecimento técnico, mas também crescimento pessoal e profissional.",
    "timeline_titulo4": "2020 - Estágio de verão no instituto Eldorado.",
    "timeline_texto4": "Um dos marcos mais significativos da minha trajetória profissional foi o estágio de verão no Instituto Eldorado, localizado na UNICAMP. Durante esse período, fui desafiado a desenvolver scripts de teste voltados ao processamento e à gestão de energia em smartphones modernos, utilizando a linguagem Python — até então, completamente nova para mim. Como havia me mudado recentemente para uma nova cidade e ainda não tinha muitos vínculos sociais, aproveitei esse momento para mergulhar no aprendizado da linguagem. Foram dois meses intensos de leitura, experimentação e desenvolvimento de projetos. Esse esforço valeu a pena: hoje, Python é a linguagem que mais domino e com a qual mais me identifico para programar.",
    "timeline_titulo5": "2021 - Estágio em engenharia elétrica na SBM Offshore",
    "timeline_texto5": "Finalmente, em 2021, conquistei meu primeiro estágio na área de Engenharia Elétrica na SBM Offshore. Durante esse período, tive a oportunidade de atuar em quatro subáreas dentro do time técnico. Na área de Instrumentação, aprofundei meus conhecimentos em sistemas de detecção de fogo e gás, instrumentos de medição de nível, temperatura e pressão, além de válvulas de controle. Em Controle, aprendi sobre sistemas de automação industrial, como o PCS7, o funcionamento de CLPs (PLCs), coleta de alarmes via Dynamo Alarm Management, entre outros tópicos relacionados à lógica de controle. Na subárea Elétrica, participei da análise de eventos em máquinas elétricas, leitura e interpretação de P&IDs e diagramas unifilares, além de entender em profundidade o funcionamento dos sistemas de controle de carga elétrica a bordo de um FPSO. Também atuei na área de Atmosferas Explosivas (EX), onde tive um forte aprendizado sobre as normas de segurança aplicáveis a instalações em áreas classificadas, fundamentais para a operação segura em ambientes offshore.",
    "timeline_titulo6": "2023 - Oficialmente engenheiro eletricista pela RadiX",
    "timeline_texto6": "Em 2023, após um ano e meio como estagiário na SBM Offshore, conquistei minha primeira posição efetiva como Engenheiro Eletricista Júnior, atuando pela Radix Engenharia e Software. Durante esse período, fui responsável pelo comissionamento do System 1 na primeira unidade da SBM (Cidade de Saquarema), além de assumir integralmente as rotinas de monitoramento dos sistemas de detecção de fogo e gás. Também fui co-autor do banco de dados do projeto de Custo da Não Qualidade (CNQ) voltado para falhas em bombas offshore. Esse projeto viabilizou uma análise aprofundada das principais fontes de custo anual com manutenção corretiva, contribuindo diretamente para a redução dos gastos da companhia e para o aprimoramento da gestão de ativos críticos.",
    "timeline_titulo7": "2024 - Engenheiro de Inteligência e Monitoramento de Asset (ASI) pela SBM Offshore",
    "timeline_texto7": "Após um ano e um mês atuando como Engenheiro Eletricista pela Radix, tive a oportunidade de retornar à SBM Offshore como Engenheiro de Inteligência e Monitoramento de Asset. Nessa nova posição, assumi a responsabilidade por rotinas preditivas nas disciplinas de elétrica, controle e instrumentação. Durante esse período, aprofundei minhas habilidades em análise de dados, o que me permitiu contribuir para projetos estratégicos, como a substituição de modelos de detecção de fogo e gás com base em dados históricos de falhas. Além disso, fui responsável pelo desenvolvimento da ferramenta Operations Threat Management (OTM), hoje utilizada amplamente na companhia. O OTM coleta, processa e gerencia informações diárias de equipamentos críticos da frota, viabilizando uma resposta ágil e precisa diante dos diversos desafios operacionais enfrentados no ambiente offshore.",
    "education": "Educação",
    "construct": "Site em construção!",
    "ed_titulo1": "Graduação em engenharia elétrica - 2017 à 2023 - UNESP",
    "ed_texto1": "Iniciei minha graduação em Engenharia Elétrica na UNESP de Ilha Solteira - SP em março de 2017, integrando a turma 17.1. Devido ao impacto da pandemia de COVID-19, o curso sofreu alguns atrasos em seu cronograma, sendo concluído em janeiro de 2023, totalizando aproximadamente seis anos de formação.",
    "ed_titulo2": "Graduação em Tecnologia da Informação (TI) - 2023 à 2026 - UNIVESP",
    "ed_texto2": "Iniciei minha segunda graduação em 2023, cursando Tecnologia da Informação pela UNIVESP (Universidade Virtual do Estado de São Paulo). A conclusão do curso está prevista para julho de 2026, com titulação como tecnólogo na área.",
    "ed_titulo3": "Técnico em Informática - 2015 à 2016 (Interrompido) - CTI UNESP",
    "ed_texto3": "Ingressei no Colégio Técnico Industrial (CTI) da UNESP de Bauru em 2015, no curso técnico em Informática, período noturno. Permanecei na instituição até o início de 2017, quando precisei interromper a formação devido ao início da minha graduação em Engenharia Elétrica na UNESP de Ilha Solteira.",
    "orgulho_da_pofisson": "Profissional",
    "exptitulo1": "2014 - Assitente de informática - Casa do Real </br>(Pirajuí-SP)",
    "exptexto1": "Entre os anos de 2013 e 2015, atuei como assistente de informática no mercado Casa do Real, localizado em Pirajuí-SP, minha cidade natal. Fui responsável pelo cadastramento e organização dos produtos no sistema interno de emissão de notas fiscais, incluindo a padronização de descrições, controle de códigos e suporte à gestão de estoque digital. Além disso, contribuía com atividades operacionais da loja, como organização de prateleiras e atendimento no caixa sempre que necessário.",
    "exptitulo2": "2019 - Assistente técnico de informática - DTI UNESP </br>(Ilha Solteira-SP)",
    "exptexto2": "Entre os anos de 2019 e 2021, atuei como assistente técnico no Departamento de Tecnologia da Informação (DTI) da UNESP de Ilha Solteira. Minhas principais responsabilidades incluíam formatação e manutenção de computadores utilizados por alunos, suporte na recuperação de senhas, substituição e limpeza de ventoinhas de switches de rede, além de oferecer auxílio técnico aos estudantes em relação ao acesso à intranet e demais sistemas institucionais.",
    "exptitulo3": "2020 – Estágio de Verão em Tecnologia – Instituto Eldorado </br>(Campinas-SP)",
    "exptexto3": "Nos primeiros meses de 2020, participei de um estágio de verão no Instituto Eldorado, localizado em Campinas-SP, onde tive meu primeiro contato com a linguagem Python. Durante esse período, atuei na automação de testes de desempenho e testes de bateria de smartphones Motorola recém-lançados. Também fiz parte da equipe responsável pela validação do Motorola Razr, o primeiro modelo dobrável de nova geração da marca.",
    "exptitulo4": "2021 - Estágio em Engenharia Elétrica - SBM Offshore </br>(Santos-SP)",
    "exptexto4": "Em junho de 2021, iniciei meu estágio em Engenharia Elétrica na SBM Offshore, em Santos-SP. Durante esse período, atuei na análise de eventos envolvendo geradores e motores elétricos, desenvolvi dashboards no Power BI e PI Vision para monitoramento em tempo real de sistemas como gerenciamento de energia e detecção de fogo e gás, além de automatizar processos de análise de dados com Python. Também liderei rotinas semanais de gerenciamento de alarmes com times offshore, obtive experiência prática com a interface PCS7 e protocolos de cibersegurança, e contribuí com o desenvolvimento de ferramentas internas para controle de anomalias em instrumentos da frota.",
    "exptitulo5": "2021 - Designer e Engenheiro Eletricista - Ambar Engenharia </br>(Pirajuí-SP)",
    "exptexto5": "Paralelamente ao estágio na SBM, atuei em Pirajuí-SP como projetista e, posteriormente, engenheiro eletricista na Ambar Engenharia. Trabalhei no desenvolvimento e execução de sistemas de energia solar para residências e pequenos comércios da região. Após minha formação em 2023, passei a assinar os projetos e encaminhá-los diretamente à concessionária CPFL. Essa experiência me proporcionou um sólido aprendizado em gestão de projetos e no uso de ferramentas como o AutoCAD.",
    "exptitulo6": "2023 - Engenheiro Eletricista I - Radix </br>(Santos-SP)",
    "exptexto6": "Em 2023, fui efetivado como Engenheiro Eletricista I na Radix Engenharia e Software, atuando como terceirizado para a SBM Offshore. Mantive minhas rotinas nas áreas de elétrica, controle e instrumentação da frota SBM. Uma importante responsabilidade foi o gerenciamento do projeto System1, no qual administrei homem-hora, custos, equipamentos, materiais e embarques relacionados ao sistema da Bently Nevada. Também realizei meu primeiro embarque offshore, consolidando minha experiência prática em campo.",
    "exptitulo7": "2024 - Engenheiro de Inteligência e Monitoramento de Asset - SBM Offshore (Santos-SP)",
    "exptexto7": "Em 2024, retornei à SBM Offshore como engenheiro ASI, focado nas disciplinas de elétrica, controle e instrumentação. Desenvolvi e implementei técnicas avançadas de análise de dados para aprimorar a manutenção preditiva, reduzindo significativamente o tempo de parada dos sistemas críticos offshore. Otimizei protocolos de manutenção preventiva com análise de dados em tempo real, garantindo alta confiabilidade dos ativos. Liderei colaborações multidisciplinares para criar estruturas de vigilância de ativos, facilitando a detecção precoce de falhas e agilizando fluxos de manutenção. Investiguei incidentes elétricos, propondo ações corretivas para aumentar a segurança. Fui responsável pelo desenvolvimento e execução da ferramenta Operations Threat Management (OTM), que monitora equipamentos offshore em quase tempo real, classificando funções operacionais e fornecendo KPIs para controle de ameaças. Também otimizei a gestão de alarmes, reduzindo alarmes não essenciais e melhorando o foco operacional na sala de controle."

    },
  "en": {
    "menu_inicio": "HOME",
    "menu_educacao": "EDUCATION",
    "menu_profissional": "PROFESSIONAL",
    "menu_projetos": "PROJECTS",
    "whoami": "<h3>Hello, my name is <u>João Victor</u> (26) and I’m an electrical engineer graduated from UNESP.</h3><br> I currently work in the oil and gas industry at SBM Offshore, focusing on operational intelligence and predictive monitoring of equipment on FPSO platforms. I’m passionate about data analysis, Python, industrial automation, and cutting-edge technology applied to engineering. I enjoy solving complex problems, learning continuously, and developing solutions that deliver real impact. <br>Outside of work, I’m into finance, tech, and sports — and I’m always up for a good game or diving into something new to learn.",
    "timeline": "About me",
    "timeline_titulo1": "2013 - Webdesigner certification (AEComp)",
    "timeline_texto1": "During my teenage years, my passion for online games sparked a deep curiosity for programming. It all began with custom servers of the game Priston Tale, where I learned to modify game files, work with SQL databases, and even perform reverse engineering using hexadecimal code. This early experience laid the foundation for my journey into the development world. Driven by this interest, I enrolled in an introductory course at the former AEComp school in Pirajuí, where I was first introduced to technologies such as Macromedia Flash, Dreamweaver, HTML, CSS, and PHP.",
    "timeline_titulo2": "2015 - Technical course at Colégio Técnico Industrial - IT",
    "timeline_texto2": "Aiming to further develop my programming skills, I enrolled in one of Brazil’s most prestigious technical high schools: the Colégio Técnico Industrial “Isaac Portal Roldán” (CTI–UNESP), located in Bauru, São Paulo. During my two years at CTI, I received a strong foundation in programming languages such as PHP, Java, and C/C++, along with complementary subjects like design, statistics, advanced mathematics, and computer hardware. Although the full program spanned three years, I made the decision to leave at the end of the second year to pursue a university degree.",
    "timeline_titulo3": "2017 - Ingress on Electrical Engineering graduation.",
    "timeline_texto3": "At a certain point, I realized my knowledge of software had reached a level that allowed me to build the kinds of projects I had always envisioned. What I needed next was a deeper understanding of hardware and how systems work at a fundamental level. With that in mind, I decided to pursue a degree in Electrical Engineering at UNESP—and was fortunate to be accepted. University life brought a wide range of learning experiences, from vehicle sensing systems and electric machines to logical algorithms and various technical subjects. I graduated in January 2023, carrying with me not only strong technical foundations but also valuable personal and professional growth.",
    "timeline_titulo4": "2020 - Summer internship of technology at Instituto Eldorado - Unicamp",
    "timeline_texto4": "One of the most important milestones in my professional development was a summer internship at Instituto Eldorado, located at UNICAMP. During the internship, I was challenged to develop test scripts for processing and power management in modern smartphones using Python — a language I had never used before. Having recently moved to a new city where I didn’t yet have a social circle, I dedicated all my free time to learning and adapting to the language. Those two months were intense, filled with reading, testing, and building small projects. The result was transformative: Python is now the language I know best and enjoy using the most.",
    "timeline_titulo5": "2021 - Electrical engineering internship at SBM Offshore",
    "timeline_texto5": "In 2021, I finally secured my first internship in Electrical Engineering at SBM Offshore. During this time, I had the opportunity to rotate through four technical subareas within the team. In the Instrumentation department, I gained valuable knowledge in fire and gas detection systems, level, temperature, and pressure instruments, as well as control valves. In Control Systems, I learned about industrial automation technologies such as PCS7, the inner workings of PLCs, alarm collection via Dynamo Alarm Management, and general control logic principles. Within the Electrical area, I participated in the investigation of electrical machinery events, interpreted P&IDs and single-line diagrams, and developed a solid understanding of the power load management system aboard an FPSO. I also worked in the Hazardous Areas (EX) field, where I gained strong knowledge of safety standards and best practices for classified areas — a key aspect of safe operations in offshore environments.",
    "timeline_titulo6": "2023 - Officially an Electrical Engineer at Radix",
    "timeline_texto6": "In 2023, after a year and a half as an intern at SBM Offshore, I secured my first official position as a Junior Electrical Engineer through Radix Engenharia e Software. During this period, I was responsible for commissioning the System 1 platform on SBM’s Cidade de Saquarema FPSO, and I took full ownership of the fire and gas detection monitoring routines. I also co-authored the database for the Non-Conformity Cost (NCC) project focused on offshore pump failures. This initiative enabled a detailed analysis of the primary contributors to SBM’s annual maintenance costs, ultimately helping reduce total expenses and improve the management of critical equipment failures.",
    "timeline_titulo7": "2024 - Asset Surveillance & Intelligence (ASI) Engineer at SBM Offshore",
    "timeline_texto7": "After one year and one month as an Electrical Engineer at Radix, I had the opportunity to return to SBM Offshore as an Asset Intelligence & Surveillance Engineer. In this new role, I became responsible for predictive routines focused on electrical, control, and instrumentation disciplines. Throughout this period, I significantly developed my data analysis skills, which enabled me to support key projects—such as the replacement of fire and gas detection models based on historical failure data. Furthermore, I led the development of the Operations Threat Management (OTM) tool, now widely adopted within the company. OTM collects, processes, and manages daily information on critical fleet equipment, enabling fast and accurate responses to various challenges faced in the offshore operational environment.",
    "education": "Education",
    "construct": "Website in development.",
    "ed_titulo1": "Bachelor's degree in electrical engineering - 2017 to 2023 - UNESP",
    "ed_texto1": "I began my undergraduate studies in Electrical Engineering at UNESP – Ilha Solteira campus (São Paulo, Brazil) in March 2017, joining class 17.1. Due to the impact of the COVID-19 pandemic, the academic schedule faced some delays, and I completed my degree in January 2023, resulting in approximately six years of total study duration.",
    "ed_titulo2": "Information Technology (IT) graduation - 2023 to 2026 - UNIVESP",
    "ed_texto2": "I began my second undergraduate degree in 2023, pursuing a program in Information Technology at UNIVESP (Virtual University of the State of São Paulo). I am expected to graduate in July 2026 with a degree as an IT technologist.",
    "ed_titulo3": "Technical Course in Information Technology – 2015 to 2016 (Incomplete) – CTI UNESP",
    "ed_texto3": "I enrolled in the Technical Industrial School (CTI) at UNESP Bauru in 2015, attending the evening program in Information Technology. I remained in the course until early 2017, when I had to discontinue in order to begin my undergraduate studies in Electrical Engineering at UNESP Ilha Solteira.",
    "orgulho_da_pofisson": "Professional",
    "exptitulo1": "2014 - IT Assistant - Casa do Real </br>(Pirajuí, Brazil)",
    "exptexto1": "From 2013 to 2015, I worked as an IT assistant at Casa do Real, a local supermarket in Pirajuí-SP, my hometown. I was responsible for registering and organizing products in the store’s invoicing system, including standardizing product descriptions, managing item codes, and supporting digital inventory control. I also helped with day-to-day store operations, such as shelf organization and working as a cashier when needed.",
    "exptitulo2": "2019 – IT Support Assistant – UNESP IT Department </br>(Ilha Solteira, Brazil)",
    "exptexto2": "From 2019 to 2021, I worked as an IT support assistant for the Information Technology Department (DTI) at UNESP – Ilha Solteira campus. My responsibilities included formatting and maintaining student computers, assisting with password recovery, cleaning and replacing switch fans, and providing technical support for students regarding intranet login access and other university systems.",
    "exptitulo3": "2020 – Technology Summer Intern – Instituto Eldorado </br>(Campinas, Brazil)",
    "exptexto3": "In early 2020, I took part in a summer internship at Instituto Eldorado, located in Campinas, Brazil, where I had my first hands-on experience with the Python programming language. During this period, I was responsible for automating battery and performance tests for newly released Motorola smartphones. I was also part of the testing team for the Motorola Razr, the brand’s first next-generation foldable phone.",
    "exptitulo4": "2021 - Electrical Engineering Internship - SBM Offshore </br>(Santos, Brazil)",
    "exptexto4": "In June 2021, I began my Electrical Engineering internship at SBM Offshore in Santos, Brazil. During this time, I analyzed events involving generators and electric motors, developed Power BI and PI Vision dashboards for real-time monitoring of systems like energy management and fire & gas detection, and automated data analysis processes using Python. I also led weekly alarm management routines with offshore teams, gained hands-on experience with the PCS7 interface and cybersecurity protocols, and supported the development of internal tools for tracking instrument anomalies across the fleet.",
    "exptitulo5": "2021 - Designer and Electrical Engineer - Ambar Engenharia </br>(Pirajuí, Brazil)",
    "exptexto5": "Alongside my internship at SBM, I worked in Pirajuí-SP as a designer and later as an electrical engineer at Ambar Engenharia. I was involved in designing and implementing solar energy systems for residential and small commercial clients in the region. After graduating in 2023, I began officially signing and submitting the projects directly to the utility company CPFL. This experience gave me valuable knowledge in project management and the use of engineering tools such as AutoCAD.",
    "exptitulo6": "2023 - Electrical Engineer I - Radix </br>(Santos-SP, Brazil)",
    "exptexto6": "In 2023, I was officially hired as Electrical Engineer I at Radix Engenharia e Software, working as a subcontractor for SBM Offshore. I continued performing electrical, control, and instrumentation routines for SBM's fleet. A key responsibility was managing the System1 project, overseeing manpower, costs, equipment, materials, and shipments related to the Bently Nevada system. Additionally, I completed my first offshore deployment, further strengthening my hands-on field experience.",
    "exptitulo7": "2024 - Asset Surveillance & Intelligence Engineer - SBM Offshore (Santos-SP, Brazil)",
    "exptexto7": "In 2024, I returned to SBM Offshore as an ASI engineer focusing on electrical, control, and instrumentation disciplines. I developed and implemented advanced data analysis techniques to enhance predictive maintenance, significantly reducing downtime of critical offshore systems. I optimized preventive maintenance protocols through real-time data analytics, ensuring high asset reliability. I led cross-functional teams to design comprehensive asset surveillance frameworks enabling early failure detection and streamlined maintenance workflows. I investigated electrical incidents and implemented corrective actions to improve safety. I was responsible for developing and deploying the Operations Threat Management (OTM) tool, which provides near real-time monitoring of offshore equipment, operational function classification, and KPIs for threat control. Additionally, I improved alarm management by reducing non-essential alarms, enhancing operational focus in the control room."
    }
}